# 5.0 Hafta  | Pandas

## Pandas Series

In [1]:
import numpy as np
import pandas as pd

Maaşları x_Maas isimli bir seri olarak oluşturalım.

In [2]:
x_Maas = pd.Series([2300, 2300, 2300, 2300, 2300, 3800, 4300, 9000, 12000, 16000])
x_Maas

0     2300
1     2300
2     2300
3     2300
4     2300
5     3800
6     4300
7     9000
8    12000
9    16000
dtype: int64

In [5]:
type(x_Maas) # tipini gözlemleyelim.

pandas.core.series.Series

In [6]:
x_Maas.axes # serinin 10 elemanlı olduğunu belirtiyor.

[RangeIndex(start=0, stop=10, step=1)]

In [7]:
x_Maas.dtype # int64 tipinde.

dtype('int64')

In [8]:
x_Maas.empty  # seri boş değildir.

False

In [8]:
x_Maas.ndim  # seri tek boyutludur.

1

In [9]:
x_Maas.size # seride 10 eleman vardır.

10

In [10]:
x_Maas.values  # serinin değerlerini yazdırır.

array([ 2300,  2300,  2300,  2300,  2300,  3800,  4300,  9000, 12000,
       16000], dtype=int64)

In [11]:
x_Maas.head(3)  # serinin ilk 3 maaşını yazdırır.

0    2300
1    2300
2    2300
dtype: int64

In [13]:
x_Maas[0:3] # serinin ilk 3 maaşını yazdırır.

0    2300
1    2300
2    2300
dtype: int64

In [15]:
x_Maas.tail(4) # serinin son 4 maaşını verir.

6     4300
7     9000
8    12000
9    16000
dtype: int64

Seriyi NumPy array'e çevirelim.

In [14]:
np_array = np.array([x_Maas])

print(type(np_array))
print(np_array)

<class 'numpy.ndarray'>
[[ 2300  2300  2300  2300  2300  3800  4300  9000 12000 16000]]

In [15]:
pd.Series([1,5,0.9,34], index = [1,3,5,7]) # indexlerini değiştirebiliriz.

1     1.0
3     5.0
5     0.9
7    34.0
dtype: float64

In [16]:
seri = pd.Series([1,5,0.9,34], index = ['a','b','c','d'])
seri

a     1.0
b     5.0
c     0.9
d    34.0
dtype: float64

In [17]:
seri["a"] # indexten çağıralım.

1.0

## Sözlük Oluşturma ve Veri Çerçevesine Çevirme

In [18]:
sozluk = {'İsim':
          pd.Series(['Ada','Cem','Sibel','Ahmet','Mehmet','Ali','Veli',
          'Ayşe','Hüseyin','Necmi','Nalan','Namık']),
          
          'Meslek':pd.Series(['işçi','işçi','memur','serbest','serbest',None,None,
          'sigortacı','işsiz',None,None,'memur']),
          
          'Tarih':pd.Series(['11.11.2010','11.11.2010','11.11.2010','18.11.2011','18.11.2011',None,None,
          None,'11.11.2010',None,'18.11.2011','18.11.2011']),          
          
          'Yaş':pd.Series([21, 24, 25, 44, 31, 27, 35, 33, 42, 29, 41, 43]),
          
          'ÇocukSayısı':pd.Series([None, None, None, None, None, 1, 2, 0, None, None, None, None]),
          
          'Puan':pd.Series([89, 87, 77, 55, 70, 79, 73, 79, 54, 92, 61, 69])}

df = pd.DataFrame(sozluk)

In [19]:
df

       İsim     Meslek       Tarih  Yaş  ÇocukSayısı  Puan
0       Ada       işçi  11.11.2010   21          NaN    89
1       Cem       işçi  11.11.2010   24          NaN    87
2     Sibel      memur  11.11.2010   25          NaN    77
3     Ahmet    serbest  18.11.2011   44          NaN    55
4    Mehmet    serbest  18.11.2011   31          NaN    70
5       Ali       None        None   27          1.0    79
6      Veli       None        None   35          2.0    73
7      Ayşe  sigortacı        None   33          0.0    79
8   Hüseyin      işsiz  11.11.2010   42          NaN    54
9     Necmi       None        None   29          NaN    92
10    Nalan       None  18.11.2011   41          NaN    61
11    Namık      memur  18.11.2011   43          NaN    69

In [20]:
df.head(3)

    İsim Meslek       Tarih  Yaş  ÇocukSayısı  Puan
0    Ada   işçi  11.11.2010   21          NaN    89
1    Cem   işçi  11.11.2010   24          NaN    87
2  Sibel  memur  11.11.2010   25          NaN    77

In [21]:
df.sample(3)

     İsim     Meslek       Tarih  Yaş  ÇocukSayısı  Puan
6    Veli       None        None   35          2.0    73
7    Ayşe  sigortacı        None   33          0.0    79
11  Namık      memur  18.11.2011   43          NaN    69

In [22]:
df.shape

(12, 6)

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   İsim         12 non-null     object
 1   Meslek       8 non-null      object
 2   Tarih        8 non-null      object
 3   Yaş          12 non-null     int64
 4   ÇocukSayısı  3 non-null      float64
 5   Puan         12 non-null     int64
dtypes: float64(1), int64(2), object(3)
memory usage: 704.0+ bytes

In [21]:
df.columns

Index(['İsim', 'Meslek', 'Tarih', 'Yaş', 'ÇocukSayısı', 'Puan'], dtype='object')

In [23]:
df['Meslek']

0          işçi
1          işçi
2         memur
3       serbest
4       serbest
5          None
6          None
7     sigortacı
8         işsiz
9          None
10         None
11        memur
Name: Meslek, dtype: object

In [26]:
df[['Yaş', 'İsim']]

    Yaş     İsim
0    21      Ada
1    24      Cem
2    25    Sibel
3    44    Ahmet
4    31   Mehmet
5    27      Ali
6    35     Veli
7    33     Ayşe
8    42  Hüseyin
9    29    Necmi
10   41    Nalan
11   43    Namık

In [27]:
df[['Yaş', 'İsim']][:3]

   Yaş   İsim
0   21    Ada
1   24    Cem
2   25  Sibel

In [28]:
df[(df['Yaş']>30) & (df['Puan']>50)][:3]["İsim"]

3     Ahmet
4    Mehmet
6      Veli
Name: İsim, dtype: object

In [29]:
df[(df['Meslek']=='işçi') | (df['Puan']>90)]["Yaş"]

0    21
1    24
9    29
Name: Yaş, dtype: int64

In [30]:
df["Meslek"].value_counts()

işçi         2
memur        2
serbest      2
işsiz        1
sigortacı    1
Name: Meslek, dtype: int64

# Pandas DataFrame Özellikleri & Oluşturma

In [31]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df.axes

[RangeIndex(start=0, stop=12, step=1),
 Index(['İsim', 'Meslek', 'Tarih', 'Yaş', 'ÇocukSayısı', 'Puan'], dtype='object')]

In [33]:
df.shape

(12, 6)

In [34]:
df.ndim

2

In [35]:
df.size

72

In [36]:
df.values

array([['Ada', 'işçi', '11.11.2010', 21, nan, 89],
       ['Cem', 'işçi', '11.11.2010', 24, nan, 87],
       ['Sibel', 'memur', '11.11.2010', 25, nan, 77],
       ['Ahmet', 'serbest', '18.11.2011', 44, nan, 55],
       ['Mehmet', 'serbest', '18.11.2011', 31, nan, 70],
       ['Ali', None, None, 27, 1.0, 79],
       ['Veli', None, None, 35, 2.0, 73],
       ['Ayşe', 'sigortacı', None, 33, 0.0, 79],
       ['Hüseyin', 'işsiz', '11.11.2010', 42, nan, 54],
       ['Necmi', None, None, 29, nan, 92],
       ['Nalan', None, '18.11.2011', 41, nan, 61],
       ['Namık', 'memur', '18.11.2011', 43, nan, 69]], dtype=object)

In [24]:
df.columns

Index(['İsim', 'Meslek', 'Tarih', 'Yaş', 'ÇocukSayısı', 'Puan'], dtype='object')

In [25]:
df.columns = ['var1','var2','var3', 'var4', 'var5','var6']
df.head()

     var1     var2        var3  var4  var5  var6
0     Ada     işçi  11.11.2010    21   NaN    89
1     Cem     işçi  11.11.2010    24   NaN    87
2   Sibel    memur  11.11.2010    25   NaN    77
3   Ahmet  serbest  18.11.2011    44   NaN    55
4  Mehmet  serbest  18.11.2011    31   NaN    70

In [39]:
df["var1"]

0         Ada
1         Cem
2       Sibel
3       Ahmet
4      Mehmet
5         Ali
6        Veli
7        Ayşe
8     Hüseyin
9       Necmi
10      Nalan
11      Namık
Name: var1, dtype: object

# Dataframe Eleman İşlemleri

In [27]:
df=df.drop('var1', axis = 1)
df  # veri çerçevesindeki var1 değişkenini kaldırdı ancak o haliyle df değişkenine kaydetmedi

         var2        var3  var4  var5  var6
0        işçi  11.11.2010    21   NaN    89
1        işçi  11.11.2010    24   NaN    87
2       memur  11.11.2010    25   NaN    77
3     serbest  18.11.2011    44   NaN    55
4     serbest  18.11.2011    31   NaN    70
5        None        None    27   1.0    79
6        None        None    35   2.0    73
7   sigortacı        None    33   0.0    79
8       işsiz  11.11.2010    42   NaN    54
9        None        None    29   NaN    92
10       None  18.11.2011    41   NaN    61
11      memur  18.11.2011    43   NaN    69

In [41]:
df.drop('var1', axis = 1, inplace = True)
df  # inplace = True dediğimiz için bu sefer değişikliği içine kaydetti.

         var2        var3  var4  var5  var6
0        işçi  11.11.2010    21   NaN    89
1        işçi  11.11.2010    24   NaN    87
2       memur  11.11.2010    25   NaN    77
3     serbest  18.11.2011    44   NaN    55
4     serbest  18.11.2011    31   NaN    70
5        None        None    27   1.0    79
6        None        None    35   2.0    73
7   sigortacı        None    33   0.0    79
8       işsiz  11.11.2010    42   NaN    54
9        None        None    29   NaN    92
10       None  18.11.2011    41   NaN    61
11      memur  18.11.2011    43   NaN    69

In [42]:
df.drop(9, axis = 0, inplace = True) # 9. indiste Necmi ile başlayan gözlemi sildik ve içine kaydettik
df

         var2        var3  var4  var5  var6
0        işçi  11.11.2010    21   NaN    89
1        işçi  11.11.2010    24   NaN    87
2       memur  11.11.2010    25   NaN    77
3     serbest  18.11.2011    44   NaN    55
4     serbest  18.11.2011    31   NaN    70
5        None        None    27   1.0    79
6        None        None    35   2.0    73
7   sigortacı        None    33   0.0    79
8       işsiz  11.11.2010    42   NaN    54
10       None  18.11.2011    41   NaN    61
11      memur  18.11.2011    43   NaN    69

In [43]:
liste = ["var5","var2", "var5"]
df[liste] # liste aracılığıyla öznitelikleri seçtik ve görüntüledik

    var5       var2  var5
0    NaN       işçi   NaN
1    NaN       işçi   NaN
2    NaN      memur   NaN
3    NaN    serbest   NaN
4    NaN    serbest   NaN
5    1.0       None   1.0
6    2.0       None   2.0
7    0.0  sigortacı   0.0
8    NaN      işsiz   NaN
10   NaN       None   NaN
11   NaN      memur   NaN

In [44]:
'var1' in df # var1 değişkeni df içinde var mı?

False

In [45]:
liste = ['var1', 'var2', 'var3', 'var4', 'var5']

In [46]:
for i in liste:
    print(i in df)       # liste içindeki değerler df içinde değişkenler mi?

False
True
True
True
True

In [47]:
df['var4'] is df['var3']  # var4 değişkeni aynı zamanda var3 değişkeni midir?

False

In [48]:
df['var10'] = df['var6'] * df['var4'] # var6 değişkenini var4 değişkeni ile çarpıldı ve var10 değişkeni yaratıp buna atandı.

In [49]:
df

         var2        var3  var4  var5  var6  var10
0        işçi  11.11.2010    21   NaN    89   1869
1        işçi  11.11.2010    24   NaN    87   2088
2       memur  11.11.2010    25   NaN    77   1925
3     serbest  18.11.2011    44   NaN    55   2420
4     serbest  18.11.2011    31   NaN    70   2170
5        None        None    27   1.0    79   2133
6        None        None    35   2.0    73   2555
7   sigortacı        None    33   0.0    79   2607
8       işsiz  11.11.2010    42   NaN    54   2268
10       None  18.11.2011    41   NaN    61   2501
11      memur  18.11.2011    43   NaN    69   2967

## Gözlem ve Değişkenlere Birlikte Erişmek

In [50]:
df.loc[0:3]  # 0'dan 3. satıra kadar, 3.satır dahil.

      var2        var3  var4  var5  var6  var10
0     işçi  11.11.2010    21   NaN    89   1869
1     işçi  11.11.2010    24   NaN    87   2088
2    memur  11.11.2010    25   NaN    77   1925
3  serbest  18.11.2011    44   NaN    55   2420

In [51]:
df.iloc[0:3]  # 0'dan 3.satıra kadar, 3. satır dahil değil " loc ve iloc farkı"  (iloc: index location)

    var2        var3  var4  var5  var6  var10
0   işçi  11.11.2010    21   NaN    89   1869
1   işçi  11.11.2010    24   NaN    87   2088
2  memur  11.11.2010    25   NaN    77   1925

In [52]:
df.iloc[0,0] # 0.satır, 0.sütun

'işçi'

In [53]:
df.iloc[:3,:2]  # 0'dan 3'e kadar satırlar, 0'dan 2'e kadar sütunlar.

    var2        var3
0   işçi  11.11.2010
1   işçi  11.11.2010
2  memur  11.11.2010

In [54]:
df.iloc[2:4 , 1:3]  # 2.satırdan 4.satıra kadar, 1.sütundan 3.sütuna kadar

         var3  var4
2  11.11.2010    25
3  18.11.2011    44

In [55]:
df[df.var4 >25]  # var4 değişkeni 25 den büyük olan gözlemleri yazdırır.

         var2        var3  var4  var5  var6  var10
3     serbest  18.11.2011    44   NaN    55   2420
4     serbest  18.11.2011    31   NaN    70   2170
5        None        None    27   1.0    79   2133
6        None        None    35   2.0    73   2555
7   sigortacı        None    33   0.0    79   2607
8       işsiz  11.11.2010    42   NaN    54   2268
10       None  18.11.2011    41   NaN    61   2501
11      memur  18.11.2011    43   NaN    69   2967

## Birleştirme (Join) İşlemleri

df değerlerinden var5 ve var3 değişkenlerini çıkartıp yeni bir df2 değişkeni yaratarak bu değişkene atayalım.

In [56]:
df2 = df.drop(["var5", "var3"], axis = 1)
df2.head()

      var2  var4  var6  var10
0     işçi    21    89   1869
1     işçi    24    87   2088
2    memur    25    77   1925
3  serbest    44    55   2420
4  serbest    31    70   2170

In [57]:
pd.concat([df, df2], axis = 1)  # axis = 1 verdiğimiz için yatay birleştirme yaptı, sütunları birleştirdi.

,var2,var3,var4,var5,var6,var10,var2,var4,var6,var10
0,işçi,11.11.2010,21,NaN,89,1869,işçi,21,89,1869
1,işçi,11.11.2010,24,NaN,87,2088,işçi,24,87,2088
2,memur,11.11.2010,25,NaN,77,1925,memur,25,77,1925
3,serbest,18.11.2011,44,NaN,55,2420,serbest,44,55,2420
4,serbest,18.11.2011,31,NaN,70,2170,serbest,31,70,2170
5,None,None,27,1.0,79,2133,None,27,79,2133
6,None,None,35,2.0,73,2555,None,35,73,2555
7,sigortacı,None,33,0.0,79,2607,sigortacı,33,79,2607
8,işsiz,11.11.2010,42,NaN,54,2268,işsiz,42,54,2268
10,None,18.11.2011,41,NaN,61,2501,None,41,61,2501
11,memur,18.11.2011,43,NaN,69,2967,memur,43,69,2967

In [58]:
pd.concat([df,df2])

# halbuki varsayılan axis = 0 ve satır olarak birleştiriyor,
# ayrıca değişken isimlerinin aynı olduğunu unutmamak lazım, değişken isimlerini ölçüt alır birleştirme esnasında.

C:\Users\deniz.kilinc\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    var10       var2        var3  var4  var5  var6
0    1869       işçi  11.11.2010    21   NaN    89
1    2088       işçi  11.11.2010    24   NaN    87
2    1925      memur  11.11.2010    25   NaN    77
3    2420    serbest  18.11.2011    44   NaN    55
4    2170    serbest  18.11.2011    31   NaN    70
5    2133       None        None    27   1.0    79
6    2555       None        None    35   2.0    73
7    2607  sigortacı        None    33   0.0    79
8    2268      işsiz  11.11.2010    42   NaN    54
10   2501       None  18.11.2011    41   NaN    61
11   2967      memur  18.11.2011    43   NaN    69
0    1869       işçi         NaN    21   NaN    89
1    2088       işçi         NaN    24   NaN    87
2    1925      memur         NaN    25   NaN    77
3    2420    serbest         NaN    44   NaN    55
4    2170    serbest         NaN    31   NaN    70
5    2133       None         NaN    27   NaN    79
6    2555       None         NaN    35   NaN    73
7    2607  sigortacı         NaN    33   NaN    79
8    2268      işsiz         NaN    42   NaN    54
10   2501       None         NaN    41   NaN    61
11   2967      memur         NaN    43   NaN    69

İndisleri 11 sonrası tekrar 0 dan başlatmış, indis değerlerini göz ardı edelim.

In [59]:
pd.concat([df,df2], ignore_index = True)  
# indexleri önemsemiyorum, göz ardı ediyorum, o tekrardan revize ediyor.

C:\Users\deniz.kilinc\AppData\Local\Continuum\anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

    var10       var2        var3  var4  var5  var6
0    1869       işçi  11.11.2010    21   NaN    89
1    2088       işçi  11.11.2010    24   NaN    87
2    1925      memur  11.11.2010    25   NaN    77
3    2420    serbest  18.11.2011    44   NaN    55
4    2170    serbest  18.11.2011    31   NaN    70
5    2133       None        None    27   1.0    79
6    2555       None        None    35   2.0    73
7    2607  sigortacı        None    33   0.0    79
8    2268      işsiz  11.11.2010    42   NaN    54
9    2501       None  18.11.2011    41   NaN    61
10   2967      memur  18.11.2011    43   NaN    69
11   1869       işçi         NaN    21   NaN    89
12   2088       işçi         NaN    24   NaN    87
13   1925      memur         NaN    25   NaN    77
14   2420    serbest         NaN    44   NaN    55
15   2170    serbest         NaN    31   NaN    70
16   2133       None         NaN    27   NaN    79
17   2555       None         NaN    35   NaN    73
18   2607  sigortacı         NaN    33   NaN    79
19   2268      işsiz         NaN    42   NaN    54
20   2501       None         NaN    41   NaN    61
21   2967      memur         NaN    43   NaN    69

# Merge ile DataFrame Birleştirmesi

In [60]:
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'İK']})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [61]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ise_giris': [2010, 2009, 2014, 2019]})

df2

  calisanlar  ise_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [62]:
pd.merge(df1, df2)  # calisanlar iki grupta mükerrer olduğu için onları anahtar ölçüt aldı.

  calisanlar         grup  ise_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [63]:
pd.merge(df1, df2, on = 'calisanlar')  # ancak bunu biz de belirtebiliriz yardımcı olmak için.

  calisanlar         grup  ise_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [63]:
df3 = pd.merge(df1,df2)  # yeni bir df oluşturalım.

df3

  calisanlar         grup  ise_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [64]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Muhendislik', 'İK'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [65]:
df5 = pd.merge(df3,df4)
df5

  calisanlar         grup  ise_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [66]:
dfa = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [1, 2, 3, 4]})

dfa

  calisanlar  siralama
0        Ali         1
1       Veli         2
2       Ayse         3
3      Fatma         4

In [67]:
dfb = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [3, 1, 4, 2]})

dfb

  calisanlar  siralama
0        Ali         3
1       Veli         1
2       Ayse         4
3      Fatma         2

In [68]:
pd.merge(dfa, dfb, on = 'calisanlar')

  calisanlar  siralama_x  siralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3      Fatma           4           2

In [69]:
pd.merge(dfa, dfb, on = 'calisanlar', suffixes = ["_MAAS", "_DENEYIM"])

# maas sıralaması ve deneyim sıralaması olarak ayırdık.

  calisanlar  siralama_MAAS  siralama_DENEYIM
0        Ali              1                 3
1       Veli              2                 1
2       Ayse              3                 4
3      Fatma              4                 2

## Dış Kaynaklı Verileri Okuma

In [70]:
pwd

'C:\\Users\\murat\\Desktop\\philiphmorris_egitim'

In [ ]:
pd.read_csv('reading_data/ornekcsv.csv', sep = ";")

In [ ]:
pd.read_csv('reading_data/duz_metin.txt')

In [ ]:
pd.read_excel('reading_data/ornekx.xlsx')